### D tale library

In [2]:
import seaborn as sns

In [3]:
dataset=sns.load_dataset('titanic')

In [4]:
dataset.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [8]:
import dtale

In [9]:
dtale.show(dataset)

# pandas profiling

In [11]:
import seaborn as sns
import sweetviz as sv

E:\anaconda3\envs\stats\Lib\site-packages\tqdm\auto.py:21: TqdmWarning:

IProgress not found. Please update jupyter and ipywidgets. See https://ipywidgets.readthedocs.io/en/stable/user_install.html

In [12]:
df1=sns.load_dataset('tips')

In [13]:
# from pandas_profiling import ProfileReport
# # from pydantic_settings import BaseSettings
# profile=ProfileReport(df1,explorative=True)
# profile.to_file('output.html')

In [14]:
report=sv.analyze(df1)
report.show_html('sweet_report.html')

Done! Use 'show' commands to display/save.   |██████████████████████████████████████| [100%]   00:00 -> (00:00 left)

Report sweet_report.html was generated! NOTEBOOK/COLAB USERS: the web browser MAY not pop up, regardless, the report IS saved in your notebook/colab files.

# pandas Visual Analysis

In [7]:
import seaborn as sns

In [29]:
sns.get_dataset_names()

['anagrams',
 'anscombe',
 'attention',
 'brain_networks',
 'car_crashes',
 'diamonds',
 'dots',
 'dowjones',
 'exercise',
 'flights',
 'fmri',
 'geyser',
 'glue',
 'healthexp',
 'iris',
 'mpg',
 'penguins',
 'planets',
 'seaice',
 'taxis',
 'tips',
 'titanic']

In [30]:
dataset=sns.load_dataset('iris')

In [31]:
dataset.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [44]:
from pandas_visual_analysis import VisualAnalysis
%matplotlib inline

In [45]:
%matplotlib inline
VisualAnalysis(dataset) # based on dataframe.describe
#useful to remove outliers and see

VBox(children=(ToggleButtons(_dom_classes=('layout-0dce1771ea9e48118adfd51d34b7a35d',), description='Selection…

In [48]:
dataset2=sns.load_dataset('titanic')
dataset2.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [49]:
VisualAnalysis(dataset2)

VBox(children=(ToggleButtons(_dom_classes=('layout-c642d9d6d4e341db8181f166821fe7ce',), description='Selection…

# dtale on planet dataset

In [16]:
dataset2=sns.load_dataset('planets')

In [17]:
dataset2.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [19]:
dtale.show(dataset2)